examples/fsi/perpendicular-box/fluid/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{

    p
    {
            
    solver           PCG;
    preconditioner   DIC;
    tolerance        1e-8;
    relTol 	         1.0e-3;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    pcorr
    {
        $p;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    Phi
    {
        $p;
    }

    "(U|cellDisplacement)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          1e-4;
        minIter         2;
    }

    "(U|cellDisplacement)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    correctPhi          yes;
    nOuterCorrectors    50;
    nCorrectors         1;
    nNonOrthogonalCorrectors 2;

    pRefCell        0;
    pRefValue       0;

    moveMeshOuterCorrectors false;

    consistent true;
    residualControl
    {
        U 
        {
            tolerance 1e-4;
            relTol 0;
        }
        p
        {
            tolerance 1e-4;
            relTol 0;
        }
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}
